; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	spectrograph3 - mode
	thermograph0 - mode
	infrared4 - mode
	image5 - mode
	infrared1 - mode
	spectrograph2 - mode
	Star4 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation6 - direction
	Star0 - direction
	Star1 - direction
	GroundStation5 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph3)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument2 infrared4)
	(calibration_target instrument2 GroundStation6)
	(supports instrument3 infrared1)
	(supports instrument3 image5)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star0)
	(supports instrument4 image5)
	(supports instrument4 infrared4)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 GroundStation6)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument5 infrared4)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 Star0)
	(supports instrument6 infrared4)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation5)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 GroundStation5)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
)
(:goal (and
	(pointing satellite0 Planet8)
	(have_image Phenomenon7 infrared4)
	(have_image Phenomenon7 infrared1)
	(have_image Planet8 spectrograph3)
	(have_image Planet8 thermograph0)
	(have_image Phenomenon9 image5)
	(have_image Planet10 infrared1)
	(have_image Planet10 image5)
	(have_image Planet11 spectrograph3)
	(have_image Planet11 infrared1)
	(have_image Phenomenon12 infrared4)
	(have_image Phenomenon12 spectrograph2)
	(have_image Phenomenon13 spectrograph2)
))

)

; plan
1. (turn_to satellite1 groundstation6 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation6)
   goals met: 0 of 13
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 13
3. (calibrate satellite1 instrument4 groundstation6)
   added: (calibrated instrument4)
   goals met: 0 of 13
4. (turn_to satellite1 planet10 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet10)
   goals met: 0 of 13
5. (take_image satellite1 planet10 instrument4 image5)
   added: (have_image planet10 image5)
   goals met: 1 of 13
6. (turn_to satellite1 phenomenon9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 13
7. (take_image satellite1 phenomenon9 instrument4 image5)
   added: (have_image phenomenon9 image5)
   goals met: 2 of 13
8. (turn_to satellite1 phenomenon7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon7)
   goals met: 2 of 13
9. (take_image satellite1 phenomenon7 instrument4 infrared4)
   added: (have_image phenomenon7 infrared4)
   goals met: 3 of 13
10. (turn_to satellite1 phenomenon12 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 13
11. (take_image satellite1 phenomenon12 instrument4 infrared4)
   added: (have_image phenomenon12 infrared4)
   goals met: 4 of 13
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 13
13. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 4 of 13
14. (turn_to satellite0 phenomenon12 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 13
15. (take_image satellite0 phenomenon12 instrument1 spectrograph2)
   added: (have_image phenomenon12 spectrograph2)
   goals met: 5 of 13
16. (turn_to satellite0 phenomenon13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 13
17. (take_image satellite0 phenomenon13 instrument1 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   goals met: 6 of 13
18. (turn_to satellite0 phenomenon7 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon7)
   goals met: 6 of 13
19. (take_image satellite0 phenomenon7 instrument1 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 7 of 13
20. (turn_to satellite0 planet10 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet10)
   goals met: 7 of 13
21. (take_image satellite0 planet10 instrument1 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 8 of 13
22. (turn_to satellite0 planet11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet11)
   goals met: 8 of 13
23. (take_image satellite0 planet11 instrument1 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 9 of 13
24. (take_image satellite0 planet11 instrument1 spectrograph3)
   added: (have_image planet11 spectrograph3)
   goals met: 10 of 13
25. (turn_to satellite0 planet8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet8)
   goals met: 11 of 13
26. (take_image satellite0 planet8 instrument1 spectrograph3)
   added: (have_image planet8 spectrograph3)
   goals met: 12 of 13
27. (take_image satellite0 planet8 instrument1 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 13 of 13
